// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт,
//  какое число большее, а какое меньшее.

// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

//  int a, b;
 
//         Console.WriteLine("Введите первое число : ");
        

//         a = Convert.ToInt32(Console.ReadLine());
 
//         Console.WriteLine("Введите второе число : ");

//         b = Convert.ToInt32(Console.ReadLine());
 
//         if (a > b)
 
//         {
 
//             Console.WriteLine("{0} наибольшее число", a);
 
//         }
 
//         else
 
//         {
 
//             Console.WriteLine("{0} наибольшее число ", b);
 
//         }
 
//         Console.ReadLine();












// Задача 4: Напишите программу, которая принимает на вход три числа 
// и выдаёт максимальное из этих чисел.

// int a, b, c;

//         Console.WriteLine("Введите первое число : ");
        

//         a = Convert.ToInt32(Console.ReadLine());
 
//         Console.WriteLine("Введите второе число : ");

//         b = Convert.ToInt32(Console.ReadLine());

//                 Console.WriteLine("Введите третье число : ");

//         c = Convert.ToInt32(Console.ReadLine());



 
// if (a > b &&  a > c)
 
//         {
 
//             Console.WriteLine("{0} наибольшее число", a);
 
//         }
 
//        if (b > a &&  b > c)
 
//         {
 
//             Console.WriteLine("{0} наибольшее число ", b);
 
//         }
 
//     if (c > a &&  c > b)

//      {
 
//             Console.WriteLine("{0} наибольшее число ", c);
 
//         }
    

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22






// Задача 6: Напишите программу, которая на вход принимает число и выдаёт,
//  является ли число чётным (делится ли оно на два без остатка).

// int a;                             
//             Console.Write("введите число: ");
//             a= Console.Read();
 
//             if (a % 2==0)
//             {
//                 Console.WriteLine("число чётное");
           
//             }
//             else
//             {
//                 Console.WriteLine("Число нечётное");
//             }


// 4 -> да
// -3 -> нет
// 7 -> нет







// Задача 8: Напишите программу, которая на вход принимает число (N),
//  а на выходе показывает все чётные числа от 1 до N.

  
        
        // int n = 0;
        // Console.WriteLine("Введите число N");
        // int m = int.Parse(Console.ReadLine());
        // for (int i = n; i <= m; i++)
        // {
        //     if (i % 2 == 0) 
        //     {
        //         Console.Write(i + " ");
        //     }
        // }
        // Console.ReadLine();
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8